README.org
#+TITLE: README
#+AUTHOR: K Gopal Krishna
#+PROPERTY: header-args :mkdirp yes

* Autostart
** Scripts
*** SSH
Cache all ssh keys with an ssh-agent for instant ssh logins
#+BEGIN_SRC sh :tangle autostart/.config/autostart-scripts/ssh-add.sh :shebang "#!/usr/bin/env bash"
  # Enable extended globbing
  shopt -s extglob dotglob nullglob

  # Add all files in the keys directory that do not end with .pub
  ssh-add "${HOME}"/.vault/ssh/login/!(*.pub) </dev/null
#+END_SRC
* Chromium (Ungoogled)
** Environment Variables
From Debian bug tracker:
#+begin_quote
As can be seen in the upstream discussion, this happens whenever mesa
drivers are used since threads are used in their GLSL shader
implementation.  This does have a consequence, chromium's GPU driver
will not be sandboxed.  You can see this in about:gpu.

Also seen upstream, it should be possible to work around the problem
by setting MESA_GLSL_CACHE_DISABLE=true.

Best wishes,
Mike
#+end_quote

#+BEGIN_SRC text
  MESA_GLSL_CACHE_DISABLE=true
#+END_SRC
** Flags
A better explanation can be found [[https://peter.sh/experiments/chromium-command-line-switches/][here]].
#+BEGIN_SRC conf :tangle chromium/.config/chromium-flags.conf
  # Disable workarounds for various GPU driver bugs.
  # --disable-gpu-driver-bug-workarounds
  # Enable hardware acceleration
  --enable-accelerated-mjpeg-decode
  --enable-accelerated-video
  --enable-gpu-rasterization
  --enable-native-gpu-memory-buffers
  --enable-zero-copy
  --ignore-gpu-blacklist
  # Disables the crash reporting.
  --disable-breakpad
  # Disables cloud backup feature.
  --disable-cloud-import
  # Disables installation of default apps on first run. This is used during automated testing.
  --disable-default-apps
  # Disables the new Google favicon server for fetching favicons for Most Likely tiles on the New Tab Page.
  --disable-ntp-most-likely-favicons-from-server
  # Disables showing popular sites on the NTP.
  --disable-ntp-popular-sites
  # Disable auto-reload of error pages if offline.
  --disable-offline-auto-reload
  # Disables sign-in promo.
  --disable-signin-promo
  # The "disable" flag for kEnableSingleClickAutofill.
  --disable-single-click-autofill
  # Disables syncing browser data to a Google Account.
  --disable-sync
  # Disables the default browser check. Useful for UI/browser tests where we want to avoid having the default browser info-bar displayed.
  --no-default-browser-check
  # Don't send hyperlink auditing pings.
  --no-pings
  # Enable Dark Mode
  --force-dark-mode
  --enable-features=WebUIDarkMode
#+END_SRC
* Desktop
** Invidious
#+BEGIN_SRC conf :tangle desktop/.local/share/applications/invidious.desktop :shebang "#!/usr/bin/env xdg-open"
  [Desktop Entry]
  Name=Invidious
  StartupNotify=true
  Icon=/home/kayg/Pictures/Icons/youtube.png
  Comment=Most popular video streaming platform
  Exec=chromium --user-data-dir=${HOME}/.config/chromium/Apps --app=https://tube.kayg.org/
  Terminal=false
  Type=Application
  MimeType=x-scheme-handler/youtube;
  StartupWMClass=invidious
  Categories=Audio;Music;Player;AudioVideo;
#+END_SRC
** Riot
#+BEGIN_SRC conf :tangle desktop/.local/share/applications/riot.desktop :shebang "#!/usr/bin/env xdg-open"
  [Desktop Entry]
  Name=Riot
  Comment=A feature-rich client for Matrix.org
  Exec=chromium --user-data-dir=${HOME}/.config/chromium/Apps --app=https://riot.im/app/
  Terminal=false
  Type=Application
  Icon=/home/kayg/Pictures/Icons/riot.png
  StartupWMClass="Riot"
  Categories=Network;InstantMessaging;Chat;IRCClient
#+END_SRC
** Slack
#+BEGIN_SRC conf :tangle desktop/.local/share/applications/slack.desktop :shebang "#!/usr/bin/env xdg-open"
  [Desktop Entry]
  Name=Slack
  StartupWMClass=Slack
  Comment=Where work happens
  GenericName=Slack Desktop
  Exec=chromium --user-data-dir=${HOME}/.config/chromium/Apps --app=https://iiit-bhcoding.slack.com/
  Icon=slack
  Terminal=false
  Type=Application
  MimeType=x-scheme-handler/slack;
  StartupNotify=true
  Categories=GNOME;GTK;Network;InstantMessaging;
#+END_SRC
* Emacs
After an year of configuring Emacs, I have somehow reached
exactly at a point which mimics the style and philosophy of
Doom Emacs without realizing it. Although my configuration
was, at heart, a doomacs; in performance and functionality,
it lagged behind by a significant margin.

I have found myself frustrated by the fact that I have to
bake in functionality of every kind when I'm in /need/ of
that particular functionality, and hence, a lot of time was
spent in adding functionality rather than being creative or
productive. My first train of thought was to try something
which abstracted all of this functionality into a single
click -- something like VSCodium -- but the problem with
that particular editor is it isn't particularly hackable.
Apart from a hundred or so rants about how lacking VSCodium
is to my pal [[https://pandacowbat.com][Anwes]], one particular thing that irked me a lot
was the incessant need to reach for the mouse for something
or the other. I would have to change the whole keyboard
shortcuts layout to customize it to my needs and what was
worse is that I would have to remember two of those layouts
-- one which worked with the vim emulation and one which
worked with native VSCodium -- and the latter doesn't even
support three key chord bindings at the time of writing
this.

What VSCodium excels at, though, is the autocompletion,
intellisense, /almost/ baked-in like support for linting,
checking, debugging. LSP is a first class citizen in
VSCodium and VSCodium is the first (and perhaps the only?)
editor that LSP is tested on. All of this makes LSP on
something like Emacs a slow, tedious hog; adding further
disappointment given the time taken to configure it.

The solution -- or perhaps -- the best balance that I could
find was in **doom** (pun intended). Doom Emacs (for now, at
least) seems to do everything I need, OOTB; has a
trouble-free way of adding language support. So I am
throwing away (or refactoring?) my 1 year-in-the-making
configuration of Emacs to find my peace in doom.
** Init
#+BEGIN_SRC emacs-lisp :tangle emacs/.config/doom/init.el
  ;;; init.el -*- lexical-binding: t; -*-

  ;; Copy this file to ~/.doom.d/init.el or ~/.config/doom/init.el ('doom install'
  ;; will do this for you). The `doom!' block below controls what modules are
  ;; enabled and in what order they will be loaded. Remember to run 'doom refresh'
  ;; after modifying it.
  ;;
  ;; More information about these modules (and what flags they support) can be
  ;; found in modules/README.org.

  (doom! :input
         ;;chinese
         ;;japanese

         :completion
         company           ; the ultimate code completion backend
         ;;helm              ; the *other* search engine for love and life
         ;;ido               ; the other *other* search engine...
         ivy               ; a search engine for love and life

         :ui
         ;;deft              ; notational velocity for Emacs
         doom              ; what makes DOOM look the way it does
         doom-dashboard    ; a nifty splash screen for Emacs
         doom-quit         ; DOOM quit-message prompts when you quit Emacs
         ;;fill-column       ; a `fill-column' indicator
         hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
         ;;hydra
         indent-guides     ; highlighted indent columns
         modeline          ; snazzy, Atom-inspired modeline, plus API
         nav-flash         ; blink the current line after jumping
         ;;neotree           ; a project drawer, like NERDTree for vim
         ophints           ; highlight the region an operation acts on
         (popup            ; tame sudden yet inevitable temporary windows
          +all             ; catch all popups that start with an asterix
          +defaults)       ; default popup rules
         (pretty-code       ; replace bits of code with pretty symbols
          +iosevka)
         tabs              ; an tab bar for Emacs
         treemacs          ; a project drawer, like neotree but cooler
         ;;unicode           ; extended unicode support for various languages
         vc-gutter         ; vcs diff in the fringe
         vi-tilde-fringe   ; fringe tildes to mark beyond EOB
         window-select     ; visually switch windows
         workspaces        ; tab emulation, persistence & separate workspaces
         zen               ; distraction-free coding or writing


         :editor
         (evil +everywhere); come to the dark side, we have cookies
         file-templates    ; auto-snippets for empty files
         ;;god               ; run Emacs commands without modifier keys
         fold              ; (nigh) universal code folding
         ;;(format +onsave)  ; automated prettiness
         ;;lispy             ; vim for lisp, for people who dont like vim
         multiple-cursors  ; editing in many places at once
         ;;objed             ; text object editing for the innocent
         ;;parinfer          ; turn lisp into python, sort of
         rotate-text       ; cycle region at point between text candidates
         snippets          ; my elves. They type so I don't have to
         ;;word-wrap         ; soft wrapping with language-aware indent

         :emacs
         dired             ; making dired pretty [functional]
         electric          ; smarter, keyword-based electric-indent
         ibuffer           ; interactive buffer management
         vc                ; version-control and Emacs, sitting in a tree

         :term
         eshell            ; a consistent, cross-platform shell (WIP)
         ;;shell             ; a terminal REPL for Emacs
         ;;term              ; terminals in Emacs
         vterm             ; another terminals in Emacs

         :tools
         ;;ansible
         ;;debugger          ; FIXME stepping through code, to help you add bugs
         ;;direnv
         ;;docker
         ;;editorconfig      ; let someone else argue about tabs vs spaces
         ;;ein               ; tame Jupyter notebooks with emacs
         eval              ; run code, run (also, repls)
         (flycheck          ; tasing you for every semicolon you forget
          +childframe)
         ;;flyspell          ; tasing you for misspelling mispelling
         ;;gist              ; interacting with github gists
         (lookup           ; helps you navigate your code and documentation
          +docsets)        ; ...or in Dash docsets locally
         lsp
         ;;macos             ; MacOS-specific commands
         magit             ; a git porcelain for Emacs
         ;;make              ; run make tasks from Emacs
         ;;pass              ; password manager for nerds
         ;;pdf               ; pdf enhancements
         ;;prodigy           ; FIXME managing external services & code builders
         ;;rgb               ; creating color strings
         ;;terraform         ; infrastructure as code
         ;;tmux              ; an API for interacting with tmux
         ;;upload            ; map local to remote projects via ssh/ftp
         ;;wakatime

         :lang
         ;;agda              ; types of types of types of types...
         ;;assembly          ; assembly for fun or debugging
         (cc                ; C/C++/Obj-C madness
          +lsp)
         ;;clojure           ; java with a lisp
         ;;common-lisp       ; if you've seen one lisp, you've seen them all
         ;;coq               ; proofs-as-programs
         ;;crystal           ; ruby at the speed of c
         ;;csharp            ; unity, .NET, and mono shenanigans
         data              ; config/data formats
         ;;erlang            ; an elegant language for a more civilized age
         ;;elixir            ; erlang done right
         ;;elm               ; care for a cup of TEA?
         emacs-lisp        ; drown in parentheses
         ;;ess               ; emacs speaks statistics
         ;;faust             ; dsp, but you get to keep your soul
         ;;fsharp           ; ML stands for Microsoft's Language
         (go                ; the hipster dialect
          +lsp)
         (haskell +intero) ; a language that's lazier than I am
         ;;hy                ; readability of scheme w/ speed of python
         ;;idris             ;
         ;;(java +meghanada) ; the poster child for carpal tunnel syndrome
         ;;javascript        ; all(hope(abandon(ye(who(enter(here))))))
         ;;julia             ; a better, faster MATLAB
         ;;kotlin            ; a better, slicker Java(Script)
         ;;latex             ; writing papers in Emacs has never been so fun
         ;;lean
         ;;ledger            ; an accounting system in Emacs
         ;;lua               ; one-based indices? one-based indices
         markdown          ; writing docs for people to ignore
         ;;nim               ; python + lisp at the speed of c
         nix               ; I hereby declare "nix geht mehr!"
         ;;ocaml             ; an objective camel
         (org              ; organize your plain life in plain text
          +dragndrop       ; drag & drop files/images into org buffers
          ;+hugo            ; use Emacs for hugo blogging
          +ipython         ; ipython/jupyter support for babel
          +pandoc          ; export-with-pandoc support
          ;+pomodoro        ; be fruitful with the tomato technique
          +present)        ; using org-mode for presentations
         ;;perl              ; write code no one else can comprehend
         ;;php               ; perl's insecure younger brother
         ;;plantuml          ; diagrams for confusing people more
         ;;purescript        ; javascript, but functional
         (python            ; beautiful is better than ugly
          +lsp)
         ;;qt                ; the 'cutest' gui framework ever
         ;;racket            ; a DSL for DSLs
         ;;rest              ; Emacs as a REST client
         ;;ruby              ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
         (rust              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
          +lsp)
         ;;scala             ; java, but good
         ;;scheme            ; a fully conniving family of lisps
         (sh                ; she sells {ba,z,fi}sh shells on the C xor
          +lsp)
         ;;solidity          ; do you need a blockchain? No.
         ;;swift             ; who asked for emoji variables?
         ;;terra             ; Earth and Moon in alignment for performance.
         ;;web               ; the tubes

         :email
         ;;(mu4e +gmail)       ; WIP
         ;;notmuch             ; WIP
         ;;(wanderlust +gmail) ; WIP

         ;; Applications are complex and opinionated modules that transform Emacs
         ;; toward a specific purpose. They may have additional dependencies and
         ;; should be loaded late.
         :app
         ;;calendar
         ;;irc               ; how neckbeards socialize
         ;;(rss +org)        ; emacs as an RSS reader
         ;;twitter           ; twitter client https://twitter.com/vnought
         ;;(write            ; emacs for writers (fiction, notes, papers, etc.)
         ;; +wordnut         ; wordnet (wn) search
         ;; +langtool)       ; a proofreader (grammar/style check) for Emacs

         :config
         ;; For literate config users. This will tangle+compile a config.org
         ;; literate config in your `doom-private-dir' whenever it changes.
         ;;literate

         ;; The default module sets reasonable defaults for Emacs. It also
         ;; provides a Spacemacs-inspired keybinding scheme and a smartparens
         ;; config. Use it as a reference for your own modules.
         (default +bindings +smartparens))
#+END_SRC
