README.org
** Config
- Set theme & font based on the hostname
- Do not preserve indentation while tangling code blocks.
- Use child frames instead of sideline
- Modified LSP UI settings for better visibility
  - UI Doc should display longer but fewer lines
  - UI Doc should show up under cursor rather than at bottom or top
  - Since UI Doc child frame overlaps the line, it is visually helpful to
    include the header.
  - UI Doc child frame should have a different font which is smaller so as to
    fit more text
- 'jk' should cause NORMAL state regardless of the order the keys are typed in
- Use 'IBM Plex Mono' for the UI and 'Iosevka' for code
- Change background of comments to make them more readable
- Move Ivy to a frame to emulate VSCodium like UI.
#+BEGIN_SRC emacs-lisp :tangle emacs/.config/doom/config.el
  (after! org
    (setq org-src-preserve-indentation nil)
    (setq org-hide-emphasis-markers t))

  (after! lsp-ui
    (setq lsp-ui-sideline-enable nil)
    (setq lsp-ui-doc-enable t)
    (setq lsp-ui-doc-position 'at-point)
    (setq lsp-ui-doc-header t)
    (setq lsp-ui-doc-max-height 6)
    (setq lsp-ui-doc-max-width 54))

  (after! ivy
    (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-top-center))
          ivy-posframe-height-alist '((t . 10)))
    (if (member "Iosevka" (font-family-list))
        (setq ivy-posframe-parameters '((internal-border-width . 12) (font . "Iosevka")))
      ivy-posframe-parameters '((internal-border-width . 12)))
    (setq ivy-posframe-width 100)
    (ivy-posframe-mode +1))

  ;; Font changes
  (defface my-prog-mode-default-face
    '((t (:inherit default :family "Iosevka")))
    "Programming Mode Default Face")

  (add-hook 'lsp-ui-doc-frame-hook
            (lambda (frame _w)
              (set-face-attribute 'default frame :font "IBM Plex Sans" :height 120)))

  (add-hook! 'prog-mode-hook
    (face-remap-add-relative 'default 'my-prog-mode-default-face))

  (custom-theme-set-faces
    'user
    '(org-block ((t (:inherit default :family "Iosevka"))))
    '(org-code ((t (:inherit default :family "Iosevka")))))

  (setq centaur-tabs-height 60)
  (setq centaur-tabs-set-bar 'over)
  (setq centaur-tabs-set-icons t)
  (setq centaur-tabs-style "box")
  (setq centaur-tabs-gray-out-icons t)
  (setq +doom-dashboard-banner-file "/home/kayg/Downloads/banner.jpg")
  (setq +doom-dashboard-banner-padding '(1 . 2))
  (setq treemacs-width 25)
  (setq evil-escape-unordered-key-sequence t)

  (when (string= (system-name) "ruri")
    (setq doom-theme 'doom-outrun-electric)
    (setq doom-outrun-electric-comment-bg t)
    (setq doom-font (font-spec :family "IBM Plex Mono" :size 28 :weight 'semi-bold)
          doom-variable-pitch-font (font-spec :family "IBM Plex Sans" :size 26 :weight 'semi-bold)
          doom-unicode-font (font-spec :family "Input Mono Narrow" :size 28)
          doom-big-font (font-spec :family "IBM Plex Mono" :size 44 :weight 'bold)))

  (when (string= (system-name) "nana")
    (setq doom-theme 'doom-dracula)
    (setq doom-font (font-spec :family "SF Mono" :size 20 :weight 'semi-bold)
          doom-variable-pitch-font (font-spec :family "IBM Plex Sans" :size 18 :weight 'semi-bold)
          doom-unicode-font (font-spec :family "Input Mono Narrow" :size 20)
          doom-big-font (font-spec :family "SF Mono" :size 36 :weight 'semi-bold)))
#+END_SRC
** Packages
Add extra packages
#+BEGIN_SRC emacs-lisp :tangle emacs/.config/doom/packages.el
  (package! caddyfile-mode)
  (package! command-log-mode)
  (package! dockerfile-mode)
  (package! docker-compose-mode)
  (package! ivy-posframe)
#+END_SRC
* Firefox
** Profiles
- =StartWithLastProfile= ensures a profile choice isn't
  asked at startup.

Sometimes Firefox amazes me by how customizable it is. I
have +two+ three profiles with Firefox; one for browsing,
one for /research/ and one for web applications. Since a lot
of my research gets lost and I'm unable to refer to previous
findings, it helps to have a separate profile. All profiles
are stored in a standardized XDG configuration directory
(=~/.config/firefox=) rather than the default
(=~/.mozilla/firefox/=). I would also rather name my own
profiles than let firefox name them randomly.

+I tried running Electron Apps with it but sadly, things+
+like pasting images from clipboard and downloading files+
+from Skype (yes, my workplace uses *Skype* in 2019, *groan*)+
+do not work. Hence I now rely on Ungoogled Chromium to do my+
+dirty work.+

+I tried using ungoogled chromium for dirty web apps but+
+recently, on Arch Linux, =libjsoncpp= got an update and+
+broke chromium which isn't as regularly built as the+
+upstream binaries. So though, clipboard interaction was a+
+sweet feature to have, I can let it go for relatively good+
+stability.+

Ungoogled Chromium works again!

Although things work fine with UC, I'm unsure if Chromium
profiles actually provide a /temporary-container/ sort of
isolation. I say this because tabs on different profiles
show up as normal tabs in the task manager which would mean
that an application running on one profile is externally
aware. Please correct me on this if you have more
information. I also miss the declarative configuration that
Firefox offers as I reinstall often.
#+BEGIN_SRC ini :tangle firefox/.mozilla/firefox/profiles.ini
  [General]
  StartWithLastProfile=1

  [Profile0]
  Name=Browse
  IsRelative=1
  Path=../../.config/firefox/browse
  Default=1

  [Profile1]
  Name=Research
  IsRelative=1
  Path=../../.config/firefox/research
  Default=0
#+END_SRC
** UserJS
I use GHacks' UserJS which I think is an excellent beginner
point towards making your own customizations as it allows
you to focus on tweaking for usablity from an already
privacy-centered configuration.
#+BEGIN_SRC js :tangle firefox/.mozilla/firefox/user-overrides.js
  /// GPU Acceleration ///

  // Force enable hardware acceleration
  user_pref("layers.acceleration.force-enabled", true);
  // WebRender is automatically disabled for screens < 4K
  user_pref("gfx.webrender.all", true);
  // Enable accelerated azure canvas
  user_pref("gfx.canvas.azure.accelerated", true);

  /// GPU Acceleration ///

  /// Storage ///

  // Do caching in RAM instead of disk
  user_pref("browser.cache.disk.enable", false);
  user_pref("browser.cache.memory.enable", true);

  // Save session data every 5 minutes instead of every 15 seconds
  user_pref("browser.sessionstore.interval", 300000);

  /// Storage ///

  /// Search ///

  // Search via address bar
  user_pref("keyword.enabled", true);

  // Enable suggestion of searches; safe since I use SearX
  user_pref("browser.search.suggest.enabled", true);
  user_pref("browser.urlbar.suggest.searches", true);

  /// Search ///

  /// Misc ///

  // Disable letterboxing
  user_pref("privacy.resistFingerprinting.letterboxing", false);

  // Enable WebAssembly
  user_pref("javascript.options.wasm", true);

  // Browser extensions
  user_pref("browser.policies.runOncePerModification.extensionsInstall", "[
      \"https://addons.mozilla.org/firefox/downloads/latest/bitwarden-password-manager/latest.xpi\",
      \"https://addons.mozilla.org/firefox/downloads/latest/canvasblocker/latest.xpi\",
      \"https://addons.mozilla.org/firefox/downloads/latest/clearurls/latest.xpi\",
      \"https://addons.mozilla.org/firefox/downloads/latest/decentraleyes/latest.xpi\",
      \"https://addons.mozilla.org/firefox/downloads/latest/httpz/latest.xpi\",
      \"https://addons.mozilla.org/firefox/downloads/latest/invidition/latest.xpi\",
      \"https://addons.mozilla.org/firefox/downloads/latest/multi-account-containers/latest.xpi\",
      \"https://addons.mozilla.org/firefox/downloads/latest/temporary-containers/latest.xpi\",
      \"https://addons.mozilla.org/firefox/downloads/latest/ublock-origin/latest.xpi\",
      \"https://addons.mozilla.org/firefox/downloads/latest/umatrix/latest.xpi\"
  ]");

  user_pref("browser.policies.runOncePerModification.extensionsUninstall", "[
      \"amazondotcom@search.mozilla.org\",
      \"bing@search.mozilla.org\",
      \"ebay@search.mozilla.org\",
      \"google@search.mozilla.org\",
      \"twitter@search.mozilla.org\"
  ]");

  // Enable captive portal
  user_pref("etwork.captive-portal-service.enabled", true);

  // Don't clear cookies on shutdown
  user_pref("privacy.clearOnShutdown.cache", true);
  user_pref("privacy.clearOnShutdown.cookies", false);
  user_pref("privacy.clearOnShutdown.downloads", false);
  user_pref("privacy.clearOnShutdown.formdata", false);
  user_pref("privacy.clearOnShutdown.history", false);
  user_pref("privacy.clearOnShutdown.offlineApps", true);
  user_pref("privacy.clearOnShutdown.openWindows", false);
  user_pref("privacy.clearOnShutdown.sessions", true);
  user_pref("privacy.clearOnShutdown.siteSettings", false);
  user_pref("privacy.sanitize.sanitizeOnShutdown", true);

  // Disable all the firefox cruft
  user_pref("extensions.pocket.disabled", true);
  user_pref("extensions.screenshots.disabled", true);
  user_pref("browser.contentblocking.report.lockwise.enabled", false);
  user_pref("extensions.htmlaboutaddons.recommendations.enabled", false);

  // Don't restore default bookmarks
  user_pref("browser.bookmarks.restore_default_bookmarks", false);

  // Use DuckDuckGo as pinned search shortcut
  user_pref("browser.newtabpage.activity-stream.improvesearch.topSiteSearchShortcuts.havePinned", "duckduckgo");

  /// Misc ///
#+END_SRC
* Plasma
** Environment
#+BEGIN_SRC sh :tangle plasma/.config/plasma-workspace/env/askpass.sh :shebang "#!/usr/bin/env bash"
  export SSH_ASKPASS="$(command -v ksshaskpass)"
  export GIT_ASKPASS="$(command -v ksshaskpass)"
#+END_SRC
** PAM
#+BEGIN_SRC conf :tangle plasma/.pam_environment
  SSH_AUTH_SOCK DEFAULT="${XDG_RUNTIME_DIR}/ssh-agent.socket"
#+END_SRC
* Systemd
** SSH Agent
#+BEGIN_SRC conf :tangle systemd/.config/systemd/user/ssh-agent.service
  [Unit]
  Description=SSH key agent

  [Service]
  Type=simple
  Environment=SSH_AUTH_SOCK=%t/ssh-agent.socket
  ExecStart=/usr/bin/ssh-agent -D -a $SSH_AUTH_SOCK

  [Install]
  WantedBy=default.target
#+END_SRC
* Thunderbird
** Profiles
This reads the same as the profiles section of Firefox.
#+BEGIN_SRC ini :tangle thunderbird/.thunderbird/profiles.ini
  [General]
  StartWithLastProfile=1

  [Profile0]
  Name=Primary
  IsRelative=1
  Path=../.config/thunderbird/primary
  Default=1
#+END_SRC
* Scripts
A few guidelines followed throughout these scripts:

- Output is silenced and is replaced by friendly messages.
- Errors are handled explicitly instead of letting the script fail.
- Each task is divided into functions, no matter how small.
  The main function looks like nothing more than a series of steps (function calls).
- Documentation for what the function does and why is provided.
- A =$SCRIPT_PATH= is defined to determine the path of the each script.

** Functions
*** Firefox
**** Userjs
This script applies my userjs tweaks on top of GHacks userjs, proceeds to read
=profiles.ini= and copies the modified user.js into those profiles.

#+BEGIN_SRC sh :tangle scripts/.local/bin/functions/firefox/userjs :shebang "#!/usr/bin/env bash"
  mkTweaks() {
      echo -ne "Copying personal tweaks to fetched source..."
      run cp "${FIREFOX_LOCAL_PATH}/user-overrides.js" "${DEST}"

      echo -ne "Merging tweaks with ghacks user.js..."
      run "${DEST}/updater.sh" -s
  }

  applyUserJS() {
      profileList=$(cat "${FIREFOX_REMOTE_PATH}/profiles.ini" | grep -i 'Name' | cut -d '=' -f 2 | awk '{print tolower($0)}')

      echo -e "Copying user.js to profile directories..."
      for profile in ${profileList}; do
          echo -ne "  => Copying user.js to profile: ${profile}..."
          run cp "${DEST}/user.js" "${FIREFOX_PROFILES_PATH}/${profile}"
      done
  }
#+END_SRC
**** Profiles
#+BEGIN_SRC sh :tangle scripts/.local/bin/functions/firefox/profiles :shebang "#!/usr/bin/env bash"
  mkProfilesDir() {
      echo -ne "Creating firefox directory to store profiles..."
      run mkdir -p "${FIREFOX_REMOTE_PATH}" "${FIREFOX_PROFILES_PATH}"
  }

  linkProfilesINI() {
      echo -ne "Linking profiles.ini..."
      run ln -sf "${FIREFOX_LOCAL_PATH}/profiles.ini" "${FIREFOX_REMOTE_PATH}"
  }

  mkProfiles() {
      profileList=$(cat "${FIREFOX_REMOTE_PATH}/profiles.ini" | grep -i 'Name' | cut -d '=' -f 2 | awk '{print tolower($0)}')

      echo -e "Creating profile directories..."
      for profile in ${profileList}; do
          echo -ne "  => Creating profile: ${profile}..."
          run mkdir -p "${FIREFOX_PROFILES_PATH}/${profile}"
      done
  }
#+END_SRC
*** Plasma
